#include <stdio.h>

int main() {
int x, y;

printf("กรุณาป้อนตัวเลขที่ 1: ");
scanf("%d", &x);

printf("กรุณาป้อนตัวเลขที่ 2: ");
scanf("%d", &y);

if (x > y) {
printf("%d มากกว่า %d\n", x, y);
} else if (x < y) {
printf("%d น้อยกว่า %d\n", x, y);
} else {
printf("%d เท่ากับ %d\n", x, y);
}

return 0;
}
// 4 ประกาศตัวแปร x และ y สำหรับเก็บค่าตัวเลข
// 6-7 รับค่าตัวเลขแรกจากผู้ใช้
// 9-10 รับค่าตัวเลขที่สองจากผู้ใช้
//12-18 เปรียบเทียบค่า x และ y
//12-13 x มากกว่า y
//14-15 x น้อยกว่า y
//16-18 x เท่ากับ y